In [4]:
import pandas as pd
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:postgres@localhost:5432/svd')

In [9]:
amon_data = pd.read_csv("filtered_dataset_sn02.csv")
amon_data.drop('index', inplace=True, axis=1)
amon_data.index.name = 'id'
amon_data.index += 1
amon_data

,date,counts,sun_zenith,moon_zenith,moon_azimuth,moon_elevation
id,,,,,,
0,2017-04-21 02:50:54,1003,161.661,98.4510,340.097172,-71.930874
1,2017-04-21 02:51:01,1036,161.669,98.4740,340.180433,-71.938728
2,2017-04-21 02:51:05,1010,161.674,98.4880,340.228041,-71.943202
3,2017-04-21 02:51:06,1028,161.675,98.4910,340.239946,-71.944318
4,2017-04-21 02:51:11,1034,161.680,98.5080,340.299493,-71.949892
...,...,...,...,...,...,...
419291,2019-05-01 02:59:56,31161,142.230,98.8009,305.679135,-52.606840
419292,2019-05-01 02:59:57,30837,142.233,98.8042,305.683875,-52.609586
419293,2019-05-01 02:59:58,30942,142.236,98.8074,305.688615,-52.612331
419294,2019-05-01 02:59:59,31092,142.238,98.8107,305.693355,-52.615076
419295,2019-05-01 03:00:00,31012,142.241,98.8140,305.698096,-52.617821

In [12]:
amon_data

,date,counts,sun_zenith,moon_zenith,moon_azimuth,moon_elevation
id,,,,,,
1,2017-04-21 02:50:54,1003,161.661,98.4510,340.097172,-71.930874
2,2017-04-21 02:51:01,1036,161.669,98.4740,340.180433,-71.938728
3,2017-04-21 02:51:05,1010,161.674,98.4880,340.228041,-71.943202
4,2017-04-21 02:51:06,1028,161.675,98.4910,340.239946,-71.944318
5,2017-04-21 02:51:11,1034,161.680,98.5080,340.299493,-71.949892
...,...,...,...,...,...,...
419292,2019-05-01 02:59:56,31161,142.230,98.8009,305.679135,-52.606840
419293,2019-05-01 02:59:57,30837,142.233,98.8042,305.683875,-52.609586
419294,2019-05-01 02:59:58,30942,142.236,98.8074,305.688615,-52.612331
419295,2019-05-01 02:59:59,31092,142.238,98.8107,305.693355,-52.615076
419296,2019-05-01 03:00:00,31012,142.241,98.8140,305.698096,-52.617821

In [13]:
amon_data.to_sql('peaks', engine, if_exists='replace')